*برنامه ای بنویسید که با گرفتن مقدار $n$ ، احتمال های متناظر با توزیع دو جمله ای برای مقادیر مختلفِ $s$ را به ازای احتمالِ پیروزیِ 0.1 ، 0.5 و 0.9 چاپ کند.*


$$p(s)= {n \choose s} *(\pi)^s * (1- \pi)^{n-s}$$

In [237]:
def fact(n):
    if n<=1:
        return 1
    else:
        return n*fact(n-1)

def comb(n,m):
    return fact(n)/(fact(n-m)*fact(m))

In [261]:
n=int(input())

pro=[0.1,0.5,0.9]

container=([],[],[])

for i in pro:
    for j in range(n+1) :
        container[pro.index(i)].append(round((comb(n,j) * i**j * (1-i)**(n-j)),3))


for element in container:
    print(element)

4
[0.656, 0.292, 0.049, 0.004, 0.0]
[0.062, 0.25, 0.375, 0.25, 0.062]
[0.0, 0.004, 0.049, 0.292, 0.656]

*برنامه ای بنویسید که شماره دانشجویی و معدل n دانشجو را از ورودی
خوانده، سپس دانشجویی که دومين معدل را از نظر بزرگی دارد پيدا می کند و شماره دانشجویی و معدل آن را به ترتیب در دو خطِ متوالی چاپ می کند.*

In [262]:
n = int(input())

idmax1,idmax2,max1, max2 = (0,0,0,0) #tuple unpacking

for _ in range(n):
    idd=int(input())
    gpa=float(input())
    if gpa>max1:
        max2=max1
        idmax2=idmax1
        max1=gpa
        idmax1=idd
    else:
        if gpa>max2:
            max2=gpa
            idmax2=idd
print(idmax2)
print(max2)

3
1
20
2
14
3
17
3
17.0

برنامه ای بنویسید که پس از گرفتن یک string از کاربر، دیکشنری ای با دو کلیدِ "UPPER-CASE" و "LOWER-CASE" ایجاد می کند و در خروجی به عنوان مقادیرِ متناظر با کلید های گفته شده، تعدادِ حروفِ کوچک و بزرگ string ای که کاربر وارد کرده را چاپ می کند.

In [263]:
d={"UPPER_CASE":0, "LOWER_CASE":0}

x=input()

for char in x:
    if char.isupper():
        d["UPPER_CASE"]+=1
    elif char.islower():
        d["LOWER_CASE"]+=1

print(d)

hello THIS IS a test!!!
{'UPPER_CASE': 6, 'LOWER_CASE': 10}

*برنامه ای بنویسید که با گرفتن رمز عبور وارد شده توسط کاربر، تشخیص دهد که رمز عبور از امنیت کافی برخوردار است یا خیر.*

پسوردی قوی محسوب می شود که :
1. حداقل شامل یک حرف بزرگ باشد
2. حداقل شامل یک حرف کوچک باشد
3. شامل عدد باشد
4. طول آن حداقل 8 کاراکتر باشد.

*از برنامه ی شما انتظار می رود که اگر رمز عبورِ وارد شده توسط کاربر دارای شرایطِ بالا باشد، گزاره ی منطقیِ **True** و در غیر این صورت گزاره ی **False** را چاپ کند.*

In [264]:
password=input()

has_upper = False
has_lower = False
has_num = False

for ch in password:
    if ch >= "A" and ch <= "Z":
        has_upper = True
    elif ch >= "a" and ch <= "z":
        has_lower = True
    elif ch >= "0" and ch <= "9":
        has_num = True
        
if len(password) >= 8 and has_upper and has_lower and has_num:
    print(True)
else:
    print(False)

fjgk35
False

*برنامه ای بنویسید که با گرفتن مقدار $n$ ، دیکشنری ای با $n$ عنصر ایجاد کند که مقدار کلیدها از 1 تا $n$ و مقدار متناظر با کلید $i$ ام از رابطه ی زیر محاسبه شود:*

$$\frac{\sin(\frac{1}{i(i+1)})}{\cos(\frac{1}{i})\cos(\frac{1}{i+1})}$$

In [265]:
from math import sin ,cos

n=int(input())
d=dict()
for i in range(1,n+1):
    d[i]=round(sin(1/(i*(i+1))) / (cos(1/i)*cos(1/(i+1))),3)

print(d)

6
{1: 1.011, 2: 0.2, 3: 0.091, 4: 0.053, 5: 0.034, 6: 0.024}

*برنامه ای بنویسید که عدد $n$ را به عنوان ورودی از کاربر دریافت کرده و حاصل سری زیر را محاسبه کند:*

$$Calc(n) = \sum_{i=1}^{n} \prod_{j=1}^{i} {i \choose j}$$

In [266]:
n=int(input())
sum=0

for i in range(1,n+1):
    container=1
    for j in range(1,i+1):
        container*= comb(i,j)
    sum+=container

print(sum)

5
2608.0

# 1.Series
Whereas arrays use only zero-based integer indices, Series support custom indexing.

### Import pandas

In [1]:
import pandas as pd

In [267]:
grades=pd.Series([87,100,94])

In [268]:
grades

0     87
1    100
2     94
dtype: int64

The initializer also may be a tuple, a dictionary, an array, another Series or a single value.

In [269]:
pd.Series((87,100,94) )

0     87
1    100
2     94
dtype: int64

In [271]:
import numpy as np
pd.Series(np.array([87,100,94]))

0     87
1    100
2     94
dtype: int32

In [272]:
pd.Series({1:'hi',2:'bye'})

1     hi
2    bye
dtype: object

In [273]:
import numpy as np 
print(np.array([87,100,94]),'\n')

print(pd.Series(np.array([87,100,94])))

[ 87 100  94]

0     87
1    100
2     94
dtype: int32

### Creating a Series with All Elements Having the Same Value

In [275]:
pd.Series(66, ['r','w','rw'])
#second argument contains the series' indices

r     66
w     66
rw    66
dtype: int64

### Accessing a Series’ Elements

In [276]:
grades

0     87
1    100
2     94
dtype: int64

In [277]:
grades[0]

87

### Descriptive Statistics for a Series

In [278]:
#number of elements
grades.count()

3

In [282]:
#mean of elements 
grades.std()

6.506407098647712

As before, .min() .max() .std() will give you minimum,mamximum and standard deviation of elements

In [283]:
grades.describe()

count      3.000000
mean      93.666667
std        6.506407
min       87.000000
25%       90.500000
50%       94.000000
75%       97.000000
max      100.000000
dtype: float64

1. 50% represents the median of the sorted values.
2. 25% represents the median of the first half of the sorted values.
3. 75% represents the median of the second half of the sorted values.

### Creating a Series with Custom Indices

In [285]:
grades = pd.Series([87, 100, 94],index=['Wally', 'Eva', 'Sam'])
grades

Wally     87
Eva      100
Sam       94
dtype: int64

In [294]:
grades = pd.Series({'Wally': 87, 'Eva_Smith': 100, 'Sam': 94})
grades

Wally         87
Eva_Smith    100
Sam           94
dtype: int64

With dictionary initializers, the dictionary's keys become the Series’ indices, and its values become the Series’ element values

### Accessing Elements of a Series Via Custom Indices

In [295]:
grades['Eva_Smith']

100

In [296]:
grades.Eva_Smith

100

In [32]:
grades

Wally     87
Eva      100
Sam       94
dtype: int64

In [33]:
grades.values

array([ 87, 100,  94], dtype=int64)

# 2. DataFrames

creating a data frame from a list of dictionaries

In [297]:
df=pd.DataFrame([
    {'ticker':'apple','date':'2015-12-30','open':426.23},
    {'ticker':'apple','date':'2015-12-31','open':427.81},
    {'ticker':'microsoft','date':'2015-12-30','open':42.30},
    {'ticker':'ibm','date':'2015-12-30','open':101.65},
    {'ticker':'yahoo','date':'2015-12-30','open':35.53}
])
df

      ticker        date    open
0      apple  2015-12-30  426.23
1      apple  2015-12-31  427.81
2  microsoft  2015-12-30   42.30
3        ibm  2015-12-30  101.65
4      yahoo  2015-12-30   35.53

In [298]:
pd.DataFrame({'ticker':['apple','apple','microsoft','ibm','yahoo'],
             'date':[30,31,30,30,30],
             'open':[426,427,42,101,35]})

      ticker  date  open
0      apple    30   426
1      apple    31   427
2  microsoft    30    42
3        ibm    30   101
4      yahoo    30    35

creating a data frame from a dictionary of lists is the most natural way

In [301]:
grades_dict = {'Wally': [87, 96, 70], 'Eva': [100, 87, 90],
                'Sam': [94, 77, 90], 'Katie': [100, 81, 82],
                'Bob': [83, 65, 85]}
grades_dict

{'Wally': [87, 96, 70],
 'Eva': [100, 87, 90],
 'Sam': [94, 77, 90],
 'Katie': [100, 81, 82],
 'Bob': [83, 65, 85]}

In [300]:
pd.DataFrame(grades_dict)

   Wally  Eva  Sam  Katie  Bob
0     87  100   94    100   83
1     96   87   77     81   65
2     70   90   90     82   85

In [302]:
grades=pd.DataFrame(grades_dict, index=['Test1', 'Test2', 'Test3'])
grades

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65
Test3     70   90   90     82   85

## Accessing a DataFrame’s Columns

In [303]:
grades['Sam']

Test1    94
Test2    77
Test3    90
Name: Sam, dtype: int64

In [304]:
grades.Sam

Test1    94
Test2    77
Test3    90
Name: Sam, dtype: int64

## Selecting Rows via the loc and iloc Attributes

#### Accessing a row by its label via loc attribute

In [306]:
grades.loc['Test1']

Wally     87
Eva      100
Sam       94
Katie    100
Bob       83
Name: Test1, dtype: int64

#### Accessing rows by integer zero-based indices using the iloc attribute

In [307]:
grades.iloc[0]

Wally     87
Eva      100
Sam       94
Katie    100
Bob       83
Name: Test1, dtype: int64

with loc, the range specified **includes** the high index ('Test3')

In [308]:
grades

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65
Test3     70   90   90     82   85

In [309]:
grades.loc['Test1':'Test2']

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65

When using slices containing integer indices with iloc, the range you specify **excludes** the high index (2)

In [311]:
grades.iloc[0:2]

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65

### Select specific rows
use a list rather than slice notation with loc or iloc

In [312]:
grades.loc[['Test1', 'Test3']]

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test3     70   90   90     82   85

In [313]:
grades.iloc[[0, 2]]

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test3     70   90   90     82   85

### Selecting Subsets of the Rows and Columns

In [315]:
grades.loc[['Test1','Test3'], ['Eva', 'Katie']]

       Eva  Katie
Test1  100    100
Test3   90     82

In [69]:
grades.iloc[[0, 2], 0:3]

       Wally  Eva  Sam
Test1     87  100   94
Test3     70   90   90

### Accessing a Specific DataFrame Cell by Row and Column

In [316]:
grades.loc['Test1', 'Eva']

100

In [85]:
grades.at['Test1', 'Eva']

110

In [317]:
grades.iloc[2,0]

70

In [318]:
grades.iat[2,0]

70

## Boolean Indexing

In [319]:
grades

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65
Test3     70   90   90     82   85

In [71]:
grades >= 90

       Wally    Eva    Sam  Katie    Bob
Test1  False   True   True   True  False
Test2   True  False  False  False  False
Test3  False   True   True  False  False

In [320]:
grades[grades >= 90]

       Wally    Eva   Sam  Katie  Bob
Test1    NaN  100.0  94.0  100.0  NaN
Test2   96.0    NaN   NaN    NaN  NaN
Test3    NaN   90.0  90.0    NaN  NaN

In [323]:
(grades >= 80) & (grades < 90)

       Wally    Eva    Sam  Katie    Bob
Test1   True  False  False  False   True
Test2  False   True  False   True  False
Test3  False  False  False   True   True

In [324]:
grades[(grades >= 80) & (grades < 90)]

       Wally   Eva  Sam  Katie   Bob
Test1   87.0   NaN  NaN    NaN  83.0
Test2    NaN  87.0  NaN   81.0   NaN
Test3    NaN   NaN  NaN   82.0  85.0

____

In [325]:
grades.describe()

           Wally         Eva        Sam       Katie        Bob
count   3.000000    3.000000   3.000000    3.000000   3.000000
mean   84.333333   92.333333  87.000000   87.666667  77.666667
std    13.203535    6.806859   8.888194   10.692677  11.015141
min    70.000000   87.000000  77.000000   81.000000  65.000000
25%    78.500000   88.500000  83.500000   81.500000  74.000000
50%    87.000000   90.000000  90.000000   82.000000  83.000000
75%    91.500000   95.000000  92.000000   91.000000  84.000000
max    96.000000  100.000000  94.000000  100.000000  85.000000

In [327]:
pd.set_option('precision', 2)
grades.describe()

       Wally     Eva    Sam   Katie    Bob
count   3.00    3.00   3.00    3.00   3.00
mean   84.33   92.33  87.00   87.67  77.67
std    13.20    6.81   8.89   10.69  11.02
min    70.00   87.00  77.00   81.00  65.00
25%    78.50   88.50  83.50   81.50  74.00
50%    87.00   90.00  90.00   82.00  83.00
75%    91.50   95.00  92.00   91.00  84.00
max    96.00  100.00  94.00  100.00  85.00

In [328]:
pd.reset_option('display')

In [329]:
grades.describe()

           Wally         Eva        Sam       Katie        Bob
count   3.000000    3.000000   3.000000    3.000000   3.000000
mean   84.333333   92.333333  87.000000   87.666667  77.666667
std    13.203535    6.806859   8.888194   10.692677  11.015141
min    70.000000   87.000000  77.000000   81.000000  65.000000
25%    78.500000   88.500000  83.500000   81.500000  74.000000
50%    87.000000   90.000000  90.000000   82.000000  83.000000
75%    91.500000   95.000000  92.000000   91.000000  84.000000
max    96.000000  100.000000  94.000000  100.000000  85.000000

### Transposing the DataFrame with the T Attribute
T returns a transposed view (not a copy) of the DataFrame

In [330]:
grades.T

       Test1  Test2  Test3
Wally     87     96     70
Eva      100     87     90
Sam       94     77     90
Katie    100     81     82
Bob       83     65     85

In [331]:
grades.T.describe()

            Test1     Test2      Test3
count    5.000000   5.00000   5.000000
mean    92.800000  81.20000  83.400000
std      7.661593  11.54123   8.234076
min     83.000000  65.00000  70.000000
25%     87.000000  77.00000  82.000000
50%     94.000000  81.00000  85.000000
75%    100.000000  87.00000  90.000000
max    100.000000  96.00000  90.000000

### Sorting by Indices

#### by rows

In [338]:
grades.sort_index(axis=0, ascending=False)
#returns a hard copy

       Wally  Eva  Sam  Katie  Bob
Test3     70   90   90     82   85
Test2     96   87   77     81   65
Test1     87  100   94    100   83

In [336]:
grades

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65
Test3     70   90   90     82   85

In [102]:
grades.sort_index(axis=0)

       Wally  Eva  Sam  Katie  Bob
Test1     87  110   94    100   83
Test2     96   87   77     81   65
Test3     70   90   90     82   85

#### by column

In [103]:
grades.sort_index(axis=1, ascending=False)

       Wally  Sam  Katie  Eva  Bob
Test1     87   94    100  110   83
Test2     96   77     81   87   65
Test3     70   90     82   90   85

In [104]:
grades.sort_index(axis=1)

       Bob  Eva  Katie  Sam  Wally
Test1   83  110    100   94     87
Test2   65   87     81   77     96
Test3   85   90     82   90     70

### Sorting by Column Values

In [342]:
grades.sort_values(by='Test1',axis=1,ascending=False)

       Eva  Katie  Sam  Wally  Bob
Test1  100    100   94     87   83
Test2   87     81   77     96   65
Test3   90     82   90     70   85

In [115]:
grades.sort_values(by='Test1',axis=1, ascending=False)

       Wally  Eva  Sam  Katie  Bob
Test1     87  110   94    100   83
Test3     70   90   90     82   85
Test2     96   87   77     81   65

### Sorting by Row Values

In [350]:
grades.sort_values(by='Eva',axis=0, ascending=True)

       Wally  Eva  Sam  Katie  Bob
Test2     96   87   77     81   65
Test3     70   90   90     82   85
Test1     87  100   94    100   83

In [345]:
grades

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65
Test3     70   90   90     82   85

In [351]:
grades.sort_values(by='Katie',axis=0, ascending=False,inplace=True)

In [352]:
grades

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test3     70   90   90     82   85
Test2     96   87   77     81   65

## Hands on larger external data

In [367]:
df=pd.read_csv('C:\\Users\Saberi\Downloads\dataa\iris1.csv',header=0,names=['sl','sw','pl','pw','sp'])

In [369]:
df.head(10)

    sl   sw   pl   pw           sp
0  5.1  3.5  1.4  0.2  Iris-setosa
1  4.9  3.0  1.4  0.2  Iris-setosa
2  4.7  3.2  1.3  0.2  Iris-setosa
3  4.6  3.1  1.5  0.2  Iris-setosa
4  5.0  3.6  1.4  0.2  Iris-setosa
5  5.4  3.9  1.7  0.4  Iris-setosa
6  4.6  3.4  1.4  0.3  Iris-setosa
7  5.0  3.4  1.5  0.2  Iris-setosa
8  4.4  2.9  1.4  0.2  Iris-setosa
9  4.9  3.1  1.5  0.1  Iris-setosa

In [371]:
df.to_csv('C:/Users/Saberi/Desktop/tmp1.csv',index=False)

In [190]:
df.head(10)

    sl   sw   pl   pw           sp
0  5.1  3.5  1.4  0.2  Iris-setosa
1  4.9  3.0  1.4  0.2  Iris-setosa
2  4.7  3.2  1.3  0.2  Iris-setosa
3  4.6  3.1  1.5  0.2  Iris-setosa
4  5.0  3.6  1.4  0.2  Iris-setosa
5  5.4  3.9  1.7  0.4  Iris-setosa
6  4.6  3.4  1.4  0.3  Iris-setosa
7  5.0  3.4  1.5  0.2  Iris-setosa
8  4.4  2.9  1.4  0.2  Iris-setosa
9  4.9  3.1  1.5  0.1  Iris-setosa

In [372]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   sl      150 non-null    float64
 1   sw      150 non-null    float64
 2   pl      150 non-null    float64
 3   pw      150 non-null    float64
 4   sp      150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [373]:
df['sp']

0         Iris-setosa
1         Iris-setosa
2         Iris-setosa
3         Iris-setosa
4         Iris-setosa
            ...
145    Iris-virginica
146    Iris-virginica
147    Iris-virginica
148    Iris-virginica
149    Iris-virginica
Name: sp, Length: 150, dtype: object

In [374]:
type(df['sp'])

pandas.core.series.Series

In [377]:
df[['sp']]

                 sp
0       Iris-setosa
1       Iris-setosa
2       Iris-setosa
3       Iris-setosa
4       Iris-setosa
..              ...
145  Iris-virginica
146  Iris-virginica
147  Iris-virginica
148  Iris-virginica
149  Iris-virginica

[150 rows x 1 columns]

In [381]:
type(df[['sp']])

pandas.core.frame.DataFrame

In [197]:
df.isnull()

        sl     sw     pl     pw     sp
0    False  False  False  False  False
1    False  False  False  False  False
2    False  False  False  False  False
3    False  False  False  False  False
4    False  False  False  False  False
..     ...    ...    ...    ...    ...
145  False  False  False  False  False
146  False  False  False  False  False
147  False  False  False  False  False
148  False  False  False  False  False
149  False  False  False  False  False

[150 rows x 5 columns]

In [382]:
df.isnull().sum()

sl    0
sw    0
pl    0
pw    0
sp    0
dtype: int64

In [383]:
df.notnull()

       sl    sw    pl    pw    sp
0    True  True  True  True  True
1    True  True  True  True  True
2    True  True  True  True  True
3    True  True  True  True  True
4    True  True  True  True  True
..    ...   ...   ...   ...   ...
145  True  True  True  True  True
146  True  True  True  True  True
147  True  True  True  True  True
148  True  True  True  True  True
149  True  True  True  True  True

[150 rows x 5 columns]

In [384]:
df.notnull().sum()

sl    150
sw    150
pl    150
pw    150
sp    150
dtype: int64

In [385]:
df.columns

Index(['sl', 'sw', 'pl', 'pw', 'sp'], dtype='object')

In [386]:
df.columns=['sepal_length','sepal_width','petal_length','petal_width','species']

In [387]:
df.head()

   sepal_length  sepal_width  petal_length  petal_width      species
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
3           4.6          3.1           1.5          0.2  Iris-setosa
4           5.0          3.6           1.4          0.2  Iris-setosa

In [388]:
df['species'].nunique()

3

In [389]:
df['species'].unique()

array(['Iris-setosa', 'Iris-versicolor', 'Iris-virginica'], dtype=object)

In [390]:
df['species'].value_counts()

Iris-setosa        50
Iris-virginica     50
Iris-versicolor    50
Name: species, dtype: int64

In [391]:
grp=df.groupby('species')
grp.describe()

                sepal_length                                              \
                       count   mean       std  min    25%  50%  75%  max
species
Iris-setosa             50.0  5.006  0.352490  4.3  4.800  5.0  5.2  5.8
Iris-versicolor         50.0  5.936  0.516171  4.9  5.600  5.9  6.3  7.0
Iris-virginica          50.0  6.588  0.635880  4.9  6.225  6.5  6.9  7.9

                sepal_width         ... petal_length      petal_width         \
                      count   mean  ...          75%  max       count   mean
species                             ...
Iris-setosa            50.0  3.418  ...        1.575  1.9        50.0  0.244
Iris-versicolor        50.0  2.770  ...        4.600  5.1        50.0  1.326
Iris-virginica         50.0  2.974  ...        5.875  6.9        50.0  2.026


                      std  min  25%  50%  75%  max
species
Iris-setosa      0.107210  0.1  0.2  0.2  0.3  0.6
Iris-versicolor  0.197753  1.0  1.2  1.3  1.5  1.8
Iris-virginica   0.274650  1.4  1.8  2.0  2.3  2.5

[3 rows x 32 columns]

In [394]:
for cls_name, cls_df in grp:
    print(f'class={cls_name}')
    break

class=Iris-setosa

In [395]:
cls_df.head()

   sepal_length  sepal_width  petal_length  petal_width      species
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
3           4.6          3.1           1.5          0.2  Iris-setosa
4           5.0          3.6           1.4          0.2  Iris-setosa

In [17]:
import pandas as pd

df=pd.DataFrame({'col1': [1,None,3], 'col2':[4,5,6] , 'col3': [8,9,None]})
df.fillna(42,inplace=True)

   col1  col2  col3
0     1     4   8.0
1     2     5   9.0
2     3     6  42.0

In [9]:
df.loc[[0,1]]

   col1  col2
0     1     4
1     2     5